leetcode/452/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>452. Minimum Number of Arrows to Burst Balloons - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>452. Minimum Number of Arrows to Burst Balloons</h1>
            
<div id="outline-container-org4d811c8" class="outline-2">
<h2 id="org4d811c8">题目</h2>
<div class="outline-text-2" id="text-org4d811c8">
<p>
<a href="https://leetcode.com/problems/minimum-number-of-arrows-to-burst-balloons">链接</a>
</p>

<blockquote>
<p>
There are a number of spherical balloons spread in two-dimensional space. For each balloon, provided input is the start and end coordinates of the horizontal diameter. Since it's horizontal, y-coordinates don't matter and hence the x-coordinates of start and end of the diameter suffice. Start is always smaller than end. There will be at most 104 balloons.
</p>

<p>
An arrow can be shot up exactly vertically from different points along the x-axis. A balloon with xstart and xend bursts by an arrow shot at x if xstart ≤ x ≤ xend. There is no limit to the number of arrows that can be shot. An arrow once shot keeps travelling up infinitely. The problem is to find the minimum number of arrows that must be shot to burst all balloons.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org16225cd" class="outline-2">
<h2 id="org16225cd">思路</h2>
<div class="outline-text-2" id="text-org16225cd">
<p>
按照起点排序，偏离缩小重合区域，一旦无相交则说明需要多一根箭
</p>
</div>
</div>

<div id="outline-container-org1021f36" class="outline-2">
<h2 id="org1021f36">代码</h2>
<div class="outline-text-2" id="text-org1021f36">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer[][]} points
# @return {Integer}
def find_min_arrow_shots(points)
  scope = nil
  res = 0
  points.sort { |p1,p2| p1[0]&lt;=&gt;p2[0]}.each do |p|
    if (scope == nil)
      scope = p
      res = res + 1
    elsif (p[0] &lt;= scope[1])
      scope = [[p[0],scope[0]].max, [p[1], scope[1]].min]
    else
      scope = [p[0],p[1]]
      res = res + 1
    end
  end
  res
end
</pre>
</div>
</div>
</div>

<div id="outline-container-org80a31b0" class="outline-2">
<h2 id="org80a31b0">思路 2</h2>
<div class="outline-text-2" id="text-org80a31b0">
<p>
贪婪
</p>
</div>
</div>

<div id="outline-container-orgeb53448" class="outline-2">
<h2 id="orgeb53448">代码</h2>
<div class="outline-text-2" id="text-orgeb53448">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer[][]} points
# @return {Integer}
def find_min_arrow_shots(points)
  points.sort { |p1,p2| p1[1]&lt;=&gt;p2[1]}.inject([nil,0]) do |res, p|
    if (res[0] == nil or p[0] &gt; res[0])
      res[1] = res[1] + 1
      res[0] = p[1]
    end
    res
  end[1]
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2017-02-25</span>
        <span title="last modification date" class="post-info">2017-02-25</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
